app/Services/templates/shipment_premier.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
    <soapenv:Header>
        <tem:AuthHeader>
            <tem:login>{{login}}</tem:login>
            <tem:pwd>{{pwd}}</tem:pwd>
            <tem:Id_CodFacturacion>{{cod_facturacion}}</tem:Id_CodFacturacion>
        </tem:AuthHeader>
    </soapenv:Header>
    <soapenv:Body>
        <tem:CargueMasivoExterno>
            <tem:envios>
                <tem:CargueMasivoExternoDTO>
                    <tem:objEnvios>
                        <tem:EnviosExterno>
                            <tem:Num_Piezas>{{num_piezas}}</tem:Num_Piezas>
                            <tem:Ide_Producto>{{ide_producto}}</tem:Ide_Producto>
                            <tem:Des_FormaPago>{{des_forma_pago}}</tem:Des_FormaPago>
                            <tem:Des_MedioTransporte>{{des_medio_transporte}}</tem:Des_MedioTransporte>
                            <tem:Num_PesoTotal>{{num_peso_total}}</tem:Num_PesoTotal>
                            <tem:Num_ValorDeclaradoTotal>{{num_valor_declarado_total}}</tem:Num_ValorDeclaradoTotal>
                            <tem:Des_TipoDuracionTrayecto>{{des_tipo_duracion_trayecto}}</tem:Des_TipoDuracionTrayecto>
                            <tem:Des_Ciudad>{{des_ciudad}}</tem:Des_Ciudad>
                            <tem:Des_DepartamentoDestino>{{des_departamento_destino}}</tem:Des_DepartamentoDestino>
                            <tem:Des_Direccion>{{des_direccion}}</tem:Des_Direccion>
                            <tem:Nom_Contacto>{{nom_contacto}}</tem:Nom_Contacto>
                            <tem:Des_DiceContener>{{des_dice_contener}}</tem:Des_DiceContener>
                            <tem:Num_Alto>{{num_alto}}</tem:Num_Alto> 
                            <tem:Num_Ancho>{{num_ancho}}</tem:Num_Ancho> 
                            <tem:Num_Largo>{{num_largo}}</tem:Num_Largo>
                            <tem:Nom_UnidadEmpaque>{{nom_unidad_empaque}}</tem:Nom_UnidadEmpaque>
                            <tem:Des_UnidadLongitud>{{des_unidad_longitud}}</tem:Des_UnidadLongitud>
                            <tem:Des_UnidadPeso>{{des_unidad_peso}}</tem:Des_UnidadPeso>
                            <tem:Des_CiudadRemitente>{{des_ciudad_remitente}}</tem:Des_CiudadRemitente>
                            <tem:Des_DepartamentoOrigen>{{des_departamento_origen}}</tem:Des_DepartamentoOrigen>
                            <tem:Des_DireccionRemitente>{{des_direccion_remitente}}</tem:Des_DireccionRemitente>
                        </tem:EnviosExterno>
                    </tem:objEnvios>
                </tem:CargueMasivoExternoDTO>
            </tem:envios>
        </tem:CargueMasivoExterno>
    </soapenv:Body>
</soapenv:Envelope>